Students = {
    '230001': {'pwd': '123456', 'name': '张三', 'college': '软件学院', 'major': '计算机科学与技术',
               'phone': '12345678910'},
    '230002': {'pwd': '888888', 'name': '李四', 'college': '软件学院', 'major': '计算机科学与技术',
               'phone': '12345678910'},
    '230003': {'pwd': '123456', 'name': '王五', 'college': '软件学院', 'major': '计算机科学与技术',
               'phone': '12345678910'},
    '230004': {'pwd': '888888', 'name': '赵六', 'college': '软件学院', 'major': '计算机科学与技术',
               'phone': '12345678910'},
    '230005': {'pwd': '123456', 'name': '孙七'},
    '230006': {'pwd': '888888', 'name': '周八'},
    '230007': {'pwd': '123456', 'name': '吴九'},
    '230008': {'pwd': '888888', 'name': '郑十'},
    '230009': {'pwd': '123456', 'name': '黄十一'},
    '230010': {'pwd': '888888', 'name': '张十二'}
}
Teachers = {'10001': {'pwd': '123456', 'name': '张三老师', 'phone': '12345678911'},
            '10002': {'pwd': '888888', 'name': '李四老师', 'phone': '12345678911'}
            }

Grades = {
    '230001': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230002': [
        ['大学物理', '3.0', '98', '99', '98.5'],
        ['近现代史纲要', '3.0', '92', '94', '93'],
        ['高等数学', '4.0', '88', '85', '86.5'],
        ['大学英语1', '4.0', '90', '88', '89'],
        ['大学英语2', '4.0', '87', '85', '86'],
        ['模拟电路', '3.0', '88', '90', '89'],
        ['C语言程序设计', '3.0', '95', '97', '96']
    ],

    '230003': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230004': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230005': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230006': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230007': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230008': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230009': [
        ['大学物理', '3.0', '96', '98', '97'],
        ['近现代史纲要', '3.0', '90', '92', '95'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ],
    '230010': [
        ['大学物理', '3.0', '100', '100', '100'],
        ['近现代史纲要', '3.0', '100', '92', '99'],
        ['高等数学', '4.0', '96', '80', '89'],
        ['大学英语1', '4.0', '89', '87', '89'],
        ['大学英语2', '4.0', '88', '86', '87'],
        ['模拟电路', '3.0', '90', '90', '90'],
        ['C语言程序设计', '3.0', '95', '95', '95']
    ]
}

Online_Users = {'230001': 'g9V2GsXtimOpWQI7qSyfoTj0U4CM5Hez', '10001' : 'uoHq910lZOBLswURgYA3naP2itQh7evf'}

Posts = {
    '1': {'title': '列车',
          'cover': 'https://cdn-hw-static2.shanhutech.cn/bizhi/staticwp/202211/4f182009973bd05e633a12096c9d986b--4261460870.jpg',
          'content': "  在朝阳初升的时刻，一列列车缓缓驶入车站。列车的轮轴发出深沉的呼啸声，仿佛在述说着青春的故事。站台上，一位年轻的女孩静静地站在人群中，目光追随着列车的行进。她微微地皱着眉头，思绪似乎被列车带走了许多年。\n\n  这列列车曾是她青春的见证，见证了她的成长和梦想。记得那些年，她曾怀揣着年少的激情，乘坐这列列车穿梭于城市的繁华和荒凉之间。她曾坐在车窗边，眺望着窗外的风景，留下了无数美丽而独特的瞬间。\n\n  每一次列车的启动，都是她青春的起点。她在列车上度过了无数个日夜，交织出她青春的记忆。列车的震动似乎在她的身体里流淌，让她的梦想充满了希望和勇气。每一次途经的车站，都是她生命中的一个转折点，她在列车上品尝了青春的酸甜苦辣。\n\n  而如今，她站在车站上，看着列车缓缓驶离，心中掠过一丝感慨。青春已经不再，她已经不再是那个年轻活力的女孩。然而，她依然怀揣着对未来的渴望和向往。朝阳的光芒照亮了她的脸庞，她深深地吸了口气，决定为自己的未来再次出发。\n\n  她知道，青春是一列永不停歇的列车，它带领着我们穿越时光的长河。无论是在列车上还是下车，她都要坚持追寻自己的梦想，勇敢地面对生活的起伏和风雨。她相信，在朝阳的照耀下，她的人生将继续闪耀出属于自己的光彩。",
          'author': '学生处'
          },
    '2': {'title': '考试公告',
          'cover': 'https://pic.imgdb.cn/item/65505e7dc458853aefcb1b38.webp',
          'content': "尊敬的同学们：\n\n  大家好！为了培养和践行诚信意识，提高学生的道德水平，学校决定举行一次诚信考试。具体安排如下：\n\n  考试时间：2022年5月10日（星期五）下午2点至4点。\n  考试地点：各班级指定的考场。\n  考试内容：主要考察学生对诚信的理解和应对实际情境的能力。\n  考试形式：采用笔试的方式，包括选择题、填空题和应用题等。\n  考试规则：\n\n1. 请同学们准时到达考场，按照座位号坐好，不得迟到。\n2. 考试过程中严禁交流，不得抄袭、作弊，一经发现，将取消考试资格。\n3. 考试结束后，请保持考场整洁，不得擅自带走试卷或草稿纸。\n\n  考试成绩：考试成绩将作为诚信教育的重要评价指标，并记录在学生档案中。\n  考试奖励：根据考试成绩，将评选出诚信之星，并颁发相应的奖励。\n\n  希望同学们以积极的态度参加考试，认真对待每一道题目。通过这次考试，希望大家能够深刻理解诚信的重要性，树立正确的价值观，做到诚实守信，努力成为品德高尚的人才。\n\n  最后，祝同学们考试顺利，取得好成绩！\n\n  特此公告。",
          'author': '教务处'
          },
    '3': {'title': '校园介绍',
          'cover': 'https://pic.imgdb.cn/item/65505ec5c458853aefcc4536.jpg',
          'content': "  XX大学是一所位于中国的高校，创建于19xx年。学校坐落在风景秀丽的校园中，占地面积广阔，环境优美。作为一所综合性大学，XX大学以优质的教学和丰富的科研成果而闻名于国内外。\n\n  XX大学拥有一支高水平的教师队伍，其中包括一批知名学者和专家。他们在各个学科领域拥有丰富的教学和研究经验，并积极参与国内外重要科研项目。学校注重培养学生的综合素质和创新能力，提供全面的教育资源和优质的学习环境。\n\n  学校设有多个学院和研究机构，涵盖了理、工、文、经、管、法、医、教育等多个学科领域。学生可以根据自己的兴趣和特长选择相应的专业，学习专业知识并获得实践经验。同时，学校积极推动国际交流与合作，与众多国际知名大学建立了紧密的合作关系，为学生提供了广阔的国际交流平台。\n\n  XX大学注重学术研究和科技创新，已取得了许多重要的科研成果。学校设有多个研究中心和实验室，提供了良好的科研条件和支持。学生在学习过程中可以积极参与科研项目，与导师和团队共同探索学术前沿，培养创新思维和科学精神。\n\n  除了学术教育和科研成果，XX大学也注重学生的全面发展和社会责任感培养。学校提供丰富多样的校园活动和社团组织，学生可以参加各类学术、文化、体育和公益活动，拓展视野、锻炼技能。同时，学校积极推动社会实践和志愿服务，培养学生的社会责任感和公民意识。\n\n  XX大学秉承着“自信、创新、协作、奉献”的校训，致力于培养具有国际竞争力和社会责任感的高素质人才。我们欢迎各界人士和有志青年加入我们，共同创造美好的未来！",
          'author': '招生办公室'
          },
    '4': {'title': '降温通知',
          'cover': 'https://pic.imgdb.cn/item/65506036c458853aefd12664.png',
          'content': "尊敬的同学们：\n\n  大家好！近日天气逐渐转凉，气温下降，请同学们注意保暖，做好防寒措施，确保身体健康。为了提醒大家注意天气变化和健康保护，特发此通知。\n\n  注意穿衣：请同学们根据天气情况合理搭配衣物，增加衣物层次，选择保暖性好的衣物、帽子、手套等，避免受凉。\n\n  注意室内温度：在寒冷天气中，室内取暖是必要的。但请合理使用暖气设备，注意节能环保，避免过度取暖导致干燥和空气不流通。\n\n  加强锻炼：适当的体育锻炼可以增强体质，提高抵抗力。同学们可以选择适合自己的室内运动，如瑜伽、健身操等，保持身体的活跃。\n\n  注意饮食：寒冷天气中，饮食要保持营养均衡。多吃蔬菜水果，增加维生素摄入，多喝温水，避免过度饮食和暴饮暴食。\n\n  增加室内空气流通：虽然天冷，但仍需保持室内空气流通。可以适当开窗通风，避免空气污浊对健康的影响。\n\n  注意个人卫生：天气寒冷容易造成感冒等疾病传播，同学们要注意勤洗手、咳嗽和打喷嚏时使用纸巾或肘部遮挡，保持个人卫生。\n\n  希望同学们能够重视天气变化，注意保暖和健康，避免因寒冷天气而导致身体不适。如有身体不适或疑似感冒症状，请及时就医并报告班主任或辅导员。\n\n  祝愿大家度过一个健康、温暖的冬季！\n\n  特此通知。",
          'author': '教务处'
          },
    '5': {'title': '阅读丰富生活',
          'cover': 'https://pic.imgdb.cn/item/65506190c458853aefd640d4.png',
          "content": "  阅读是一扇开启智慧和世界的大门，是人类进步的阶梯。在这个信息爆炸的时代，我们更需要培养阅读的习惯和能力。阅读不仅可以拓宽我们的知识面，还可以提升我们的思维能力和表达能力。因此，让我们一起走进书海，感受阅读的魅力！\n\n  首先，阅读可以拓宽我们的视野。通过阅读，我们可以了解到丰富多彩的人生经历、不同的文化习俗和各种学科领域的知识。无论是文学作品、历史书籍、科普读物还是社会科学研究，都可以帮助我们打开心灵的窗户，触摸到更广阔的世界。\n\n  其次，阅读可以提升我们的思维能力。阅读是一种思考的过程，可以帮助我们培养分析问题、归纳总结、推理判断等思维能力。通过阅读，我们可以接触到各种不同的观点和思想，从中学会思考和辨别真假，培养独立思考的能力。\n\n  再次，阅读可以提升我们的表达能力。阅读优秀的文章和作品，可以学习到优秀的写作技巧和表达方式。通过模仿和学习，我们可以提高自己的语言表达能力，让思想更加准确地传达出去。同时，阅读还可以丰富我们的词汇量，提高我们的语言能力。\n\n  最后，阅读是一种享受。通过阅读，我们可以与作者建立起一种心灵的连接，感受到文字背后的情感和思想。阅读可以带给我们愉悦和满足感，让我们在繁忙的生活中放松身心，找到内心的宁静和安宁。\n\n  因此，让我们一起拿起书本，培养阅读的习惯。不论是纸质书籍还是电子书，不论是小说、散文还是诗歌，每天抽出一些时间来阅读，让阅读成为我们生活中不可或缺的一部分。相信通过阅读，我们将收获知识的宝藏，开启智慧的旅程！\n\n  阅读，让我们的生活更加精彩！",
          'author': '教务处'
          }
}

Courses = {
    '230001': [
        ['大学物理2', '', '', '', '', '', ''],
        ['', '', '', 'Python', '计算机网络', '', ''],
        ['', '体育', '', '', '', '', ''],
        ['', '', '', '大学物理2', '', '', '']
    ],
    '230002': [
        ['大学物理2', '', '', '', '', '', ''],
        ['', '', '', '', '模拟电路2', '', ''],
        ['计算机科学导论', '', '', '', '', '', ''],
        ['', '', '', '工程制图', '', '', '']
    ],
    '10001': [
        ['Python', '', '', '', '', '', ''],
        ['', '', '', '', '', '', ''],
        ['', 'Python', '', 'Python', '', '', ''],
        ['', '', '', '', '', '', '']
    ],
    '10002': [
        ['', '', '', '模拟电路2', '', '', ''],
        ['', '', '', '', '模拟电路2', '', ''],
        ['模拟电路2', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '']
    ],
}
